# language: ru
  Функционал: Демо-тесты на примере страницы из Wikipedia

    Сценарий: Поиск на главной странице
      Пусть пользователь находится на главной странице википедии
      Когда пользователь ищет на главной странице: Шри-Ланка
      Тогда открывается страница со статьей на тему "Шри-Ланка"

    Сценарий: Поиск со страницы статьи
      Пусть пользователь находится на странице статьи: Таиланд
      Когда пользователь ищет со страницы статьи: Бали
      Тогда открывается страница со статьей на тему "Бали"
